{"/docs/nmap/":{"data":{"":"","#":"","install-nmap#install Nmap":"Nmap install Nmap "},"title":"nmap"},"/news/":{"data":{"":" RSS Feed RESURGE Malware Exploits Ivanti Flaw with Rootkit and Web Shell Features The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has shed light on a new malware called RESURGE that has been deployed as part of … March 30, 2025 Read more → New Android Trojan Crocodilus Abuses Accessibility to Steal Banking and Crypto Credentials Cybersecurity researchers have discovered a new Android banking malware called Crocodilus that's primarily designed to target users in Spain and … March 29, 2025 Read more → BlackLock Ransomware Exposed After Researchers Exploit Leak Site Vulnerability In what's an instance of hacking the hackers, threat hunters have managed to infiltrate the online infrastructure associated with a ransomware group … March 29, 2025 Read more → Researchers Uncover 46 Critical Flaws in Solar Inverters From Sungrow, Growatt, and SMA Cybersecurity researchers have disclosed 46 new security flaws in products from three solar inverter vendors, Sungrow, Growatt, and SMA, that could be … March 28, 2025 Read more → CoffeeLoader Uses GPU-Based Armoury Packer to Evade EDR and Antivirus Detection Cybersecurity researchers are calling attention to a new sophisticated malware called CoffeeLoader that's designed to download and execute secondary … March 28, 2025 Read more → When Getting Phished Puts You in Mortal Danger Many successful phishing attacks result in a financial loss or malware infection. But falling for some phishing scams, like those currently targeting … March 27, 2025 Read more → Arrests in Tap-to-Pay Scheme Powered by Phishing Authorities in at least two U.S. states last week independently announced arrests of Chinese nationals accused of perpetrating a novel form of … March 21, 2025 Read more → DOGE to Fired CISA Staff: Email Us Your Personal Data A message posted on Monday to the homepage of the U.S. Cybersecurity \u0026 Infrastructure Security Agency (CISA) is the latest exhibit in the Trump … March 20, 2025 Read more → ClickFix: How to Infect Your PC in Three Easy Steps A clever malware deployment scheme first spotted in targeted attacks last year has now gone mainstream. In this scam, dubbed \"ClickFix,\" the visitor … March 14, 2025 Read more → Microsoft: 6 Zero-Days in March 2025 Patch Tuesday Microsoft today issued more than 50 security updates for its various Windows operating systems, including fixes for a whopping six zero-day … March 11, 2025 Read more → Go-Spoof: A Tool for Cyber Deception Go-Spoof brings an old tool to a new language. The Golang rewrite [of Portspoof] provides similar efficiency and all the same features of the … March 27, 2025 Read more → How to Test Adversary-in-the-Middle Without Hacking Tools In this video, Michael Allen discusses how to test Adversary-in-the-Middle attacks without using hacking tools. He delves into the intricacies of … March 24, 2025 Read more → Canary in the Code: Alert()-ing on XSS Exploits I’ve been a web application pentester for a while now and over the years must have found hundreds of cross-site scripting (XSS) vulnerabilities.1 … March 20, 2025 Read more → How to Hack Wi-Fi with No Wi-Fi In this video, John Strand and his team discuss the challenges of setting up and running wireless labs, particularly focusing on the issues faced … March 17, 2025 Read more → Why Your Org Needs a Penetration Test Program This webcast originally aired on February 27, 2025. Join us for a very special free one-hour Black Hills Information Security webcast with Corey Ham … March 10, 2025 Read more → Issue with tough, versions prior to 0.20.0 (Multiple CVEs) Publication Date: 2025/03/27 02:30PM PDT Description The Update Framework (TUF) is a software framework designed to protect mechanisms that … March 27, 2025 Read more → Issues with Kubernetes ingress-nginx controller (Multiple CVEs) Publication Date: 2025/03/24 09:00AM PDT Description Ingress Controllers are applications within a Kubernetes cluster that enable Ingress … March 24, 2025 Read more → Issue with the AWS CDK CLI and custom credential plugins (CVE-2025-2598) Publication Date: 2025/03/21 07:00 AM PDT Description AWS identified CVE-2025-2598, an issue in the AWS Cloud Development Kit (AWS CDK) … March 21, 2025 Read more → Issue with Temporary elevated access management (TEAM) - CVE-2025-1969 Publication Date: 2025/03/04 10:30 AM PST Description Improper request input validation in Temporary Elevated Access Management (TEAM) for … March 4, 2025 Read more → Path traversal issue in Deep Java Library - (CVE-2025-0851) Publication Date: 2025/01/29 1:30 PM PST AWS identified CVE-2025-0851, a path traversal issue in ZipUtils.unzip and TarUtils.untar in Deep Java … January 29, 2025 Read more → Addressing Federal Cybersecurity Challenges in the Cloud Era Palo Alto Networks helps U.S. Federal agencies and vendors protect against cyberthreats with FedRAMP High Authorization for network, cloud, and … March 28, 2025 Read more → Is Your Browser Ground Zero for Cyberattacks? New Omdia research commissioned by Palo Alto Networks highlights the role of a secure browser integrated with SASE for improved workforce security. … March 27, 2025 Read more → Making Every Dollar Count for Federal Cybersecurity Federal systems shift to the cloud, we aid in developing security solutions as robust as on-prem tools. We developed our FedRAMP High authorized … March 24, 2025 Read more → Palo Alto Networks Helps Secure Black Hat Asia 2025 Palo Alto Networks secures Black Hat Asia 2025 with pride. Our NOC and SOC involvement ensures uninterrupted conference experience for attendees. The … March 19, 2025 Read more → SOC and Awe — How Autonomous Security Is Changing the Game Learn how AI and cloud-native detection are revolutionizing SOCs into autonomous security ops. Clay Brothers of Unit 42 warns against traditional … March 18, 2025 Read more → "},"title":"_index"},"/tools/":{"data":{"":" Dynamic Analysis BlackThe uncompromising Python code formatterMegaLinter🦙 MegaLinter analyzes 50 languages, 22 formats, 21 tooling formats, excessive copy-pastes, spelling mistakes and security issues in your repository sources with a GitHub Action, other CI tools or locally.mypyOptional static typing for PythonSemgrepLightweight static analysis for many languages. Find bugs, enforce code standards, and block insecure code.ESLintFind and fix problems in your JavaScript code.PylintA Python static code analyzer that looks for programming errors, helps enforce a coding standard, and sniffs for code smells.Flake8A wrapper around pycodestyle, pyflakes, and McCabe for checking the style guide enforcement in Python code.BanditA security-oriented static analyzer for Python code to find common security issues.CodeQLSemantic code analysis engine from GitHub to query code like data.SonarQubeContinuous inspection of code quality to perform automatic reviews with static analysis of code to detect bugs, code smells, and security vulnerabilities.TeamscaleContinuous code quality management platform that automatically finds and fixes issues in code.ClippyA code linter for Rust that helps you write idiomatic code.go vetExamines Go source code and reports suspicious constructs, such as Printf calls whose arguments do not align with the format string.phpstanPHP Static Analysis Tool - discover bugs in your code without running it!BearerAPI security testing tool that helps you discover and fix security vulnerabilities in your APIs.cppcheckA static analysis tool for C/C++ code.PylintA Python static code analyzer that looks for programming errors, helps enforce a coding standard, and sniffs for code smells.PsalmA static analysis tool for finding errors in PHP applications.clang-tidyA clang-based C++ “linter” tool that provides an extensible framework for diagnosing and fixing typical programming errors.RubocopA Ruby static code analyzer and formatter, based on the community Ruby style guide.GitGuardian ggshieldggshield is a CLI application that runs in your local environment or in a CI environment to help you detect more than 350+ types of secrets, as well as other potential security vulnerabilities or policy breaks affecting your codebase.CognicryptCogniCrypt is a plugin for the Eclipse IDE that supports developers in using cryptography in their Java applications.Rust-analyzerA language server for Rust.GolangCI-LintGolangCI-Lint is a linters aggregator.ruffFast Python linter, written in Rust. 10-100x faster than existing linters. Compatible with Python 3.10. Supports file watcher.staticcheckstaticcheck is a go vet on steroids, applying static analysis to your Go code.PVS-StudioPVS-Studio is a tool for bug detection in the source code of programs, written in C, C++, and C#.PrettierAn opinionated code formatter.cargo-auditAudit Cargo.lock for crates with security vulnerabilities reported to the RustSec Advisory Database.SAST onlineSAST Online is a static application security testing tool that helps you find security vulnerabilities in your code.PHP coding standards fixerA tool to automatically fix PHP coding standards issues.diktatStrict coding standard for Kotlin and a linter that detects and auto-fixes code smells.SigridSigrid helps you to improve your software by measuring your system’s code quality, and then compares the results against a benchmark of thousands of industry systems to give you concrete advice on areas where you can improveCodeSceneCodeScene is a quality visualization tool that helps you prioritize technical debt, detect delivery risks, and manage the social aspects of your codebase.phanA modern static analyzer from etsyrustfmtA tool for formatting Rust code according to style guidelines.brakemanA static analysis security vulnerability scanner for Ruby on Rails applications.composer-dependency-analyserA tool to analyse the dependencies of your PHP project.Frama-CA sound and extensible static analyzer for C code.Php Inspections (EA Extended)A static code analysis tool for PHP.TypeScript Call GraphCLI to generate an interactive graph of functions and calls from your TypeScript filespyrightStatic type checker for Python, created to address gaps in existing tools like mypy.trunkA fast, efficient, and correct Rust build system.CoverityStatic analysis tool for C, C++, C#, and Java codebases.DeepSourceStatic code analysis tool for Python, Go, Ruby, and JavaScript.gofmt -sSimplifies Go code by removing extraneous whitespace and ensuring proper indentation.SQLFluffSQLFluff is a dialect-flexible and configurable SQL linter.SwiftLintA tool to enforce Swift style and conventions.jediAutocompletion/static analysis library for Python.mythrilSecurity analysis tool for Ethereum smart contracts. Static Analysis Microsoft IntelliTestGenerate a candidate suite of tests for your .NET code.Pex and MolesPex automatically generates test suites with high code coverage using automated white box analysis.chapAnalyzes un-instrumented ELF core files for leaks, memory growth, and corruption. It helps explain memory growth, can identify some forms of corruption, and supplements a debugger by giving the status of various memory locationsKLEESymbolic virtual machine built on top of the LLVM compiler infrastructure.LDRALDRA Testbed is a software analysis and testing tool suite that provides static and dynamic analysis, and unit testing for embedded applications.LLVM/ClangA collection of modular and reusable compiler and toolchain technologies.ValgrindA programming tool for memory debugging, memory leak detection, and profiling.statsvizA runtime statistics visualization tool for Go.JAVA PathFinderA model checker for Java bytecode programs.Parasoft JtestAutomated Java software testing and static analysis tool.Iroh.jsA dynamic code analysis tool for JavaScript. Iroh allows to record your code flow in realtime, intercept runtime informations and manipulate program behaviour on the fly.Jalang12Jalangi2 is a popular framework for writing dynamic analyses for JavaScript. "},"title":"Tools"}}